[
  {"title": "180 Degrees Consulting", "domain": "csu.qc.ca", "description": "Aims to connect students with nonprofits and social enterprises, providing pro bono consulting to enhance social impact."},
  {"title": "ACSiON Concordia", "domain": "csu.qc.ca", "description": "Provides students from the African diaspora with a united forum for developing ethical leadership, professionalism and entrepreneurship"},
  {"title": "African Students Association of Concordia", "domain": "csu.qc.ca", "description": "The versatility of our organization enables us to promote African culture through variety of academically driven and socially focused events."},
  {"title": "AIESEC", "domain": "csu.qc.ca", "description": "Founded in 1948, AIESEC is a non-governmental, and not-for-profit organization entirely run by youth for youth."},
  {"title": "Alpha Epsilon Phi", "domain": "gmail.com", "description": "Founded in 1909, Alpha Epsilon Phi's goal was to foster lifelong friendship and sisterhood, academics, social involvement and community service."},
  {"title": "Amana Club", "domain": "csu.qc.ca", "description": "Raising awareness about the struggles and challenges faced by the ummah globally."},
  {"title": "Angry Art Club", "domain": "gmail.com", "description": "A critique club for the community!"},
  {"title": "Applied Human Sciences Student Association (AHSCSA)", "domain": "asfa.ca", "description": "AHSCSA is a student association that plans academic and social events for applied human scinces students and builds connections with alumni and staff"},
  {"title": "Applied Human Sciences Graduate Student Association (AHSCGSA)", "domain": "gmail.com", "description": "The AHSCGSA supports all graduate students registered in Human Systems Intervention or Youth Work."},
  {"title": "Arab Student Network", "domain": "csu.qc.ca", "description": "We are a cultural club that unites and celebrates the collective Arab identity. We want to promote the diversity of the Arab world."},
  {"title": "Art Matters", "domain": "artmattersfestival.org", "description": "Art Matters is a student run art festival. We are a Concordia fee levy group."},
  {"title": "Arts and Science Federation of Associations", "domain": "asfa.ca", "description": "The Federation of Associations for Arts and Science Students"},
  {"title": "ARTT 399", "domain": "gmail.com", "description": "Interdisciplinary Student Art Collective"},
  {"title": "Ascend Concordia", "domain": "csu.qc.ca", "description": "Providing opportunities to help individuals not only cultivate leadership & professional growth but also bridge the cultural gap in the workplace."},
  {"title": "Association for Graduate Students in Psychology (AGSP)", "domain": "gmail.com", "description": "We represent the interests of psychology graduate students and organize events."},
  {"title": "Autodidacts Concordia Theatre", "domain": "csu.qc.ca", "description": "A theatre club for students from any program, any faculty, and any level of experience."},
  {"title": "Bangladesh Students Concordia BSA", "domain": "ieac.ca", "description": "Bangladesh Students' Association Concordia"},
  {"title": "Best Buddies", "domain": "csu.qc.ca", "description": "Get paired with an adult with an intellectual disability and build a long lasting friendship!"},
  {"title": "Biology Graduate Student Association (BGSA)", "domain": "gsaconcordia.ca", "description": "A student led association for graduate students in the field of biology."},
  {"title": "Biology student Association", "domain": "asfa.com", "description": "Member Association representing the biology undergraduate students"},
  {"title": "Biomedical Engineering Club", "domain": "csu.qc.ca", "description": "The BEC aims to encourage innovation, education and collaboration among students passionate about biomedical engineering."},
  {"title": "Black Students Career Development", "domain": "csu.qc.ca", "description": "Organizes flagship recruitment and networking events connecting hundreds of black students, alumni/professionals and recruiters together."},
  {"title": "Brazilian Student Association (BRASA) Concordia", "domain": "csu.qc.ca", "description": "We offer monthly events (social, workshops, career fairs) for all students at Concordia University."},
  {"title": "Canadian Refugee Initiative (The Refugee Centre)", "domain": "therefugeecentre.org", "description": "We area a canadian non-profit that provides a sustainable structure integration for Refugees and immigrants in Canada"},
  {"title": "CASA Cares", "domain": "casacares.com", "description": "CASA Cares is the charity wing of the John Molson School of Business at Concordia University. We are a student-run organization that aims to give back"},
  {"title": "CASS (Computation Arts Student Society)", "domain": "concordia.ca", "description": "CASS is a student-led group committed to representing Computation Arts students, building a strong community, and organizing events."},
  {"title": "CEED Concordia", "domain": "ceedconcordia.org", "description": "CEED Concordia is a fee-levy association of Concordia University and a non-profit organization operating in Montreal, Canada and Gulu, Uganda"},
  {"title": "Centre for Gender Advocacy//Centre de lutte contre l'oppression des genres", "domain": "genderadvocacy.org", "description": "An independent, student-funded, Concordia University organization mandated to promote gender equality and empowerment, particularly as it relates to marginalization and oppression."},
  {"title": "Chabad Student Group at Concordia University", "domain": "csu.qc.ca", "description": "Offers tons of meaningful activities and programs for Jewish students in an environment without judgment"},
  {"title": "Concordia Canadian Asian Society", "domain": "csu.qc.ca", "description": "The Concordia Canadian Asian Society is a non-Profit association representing the Asian culture within the Montreal community."},
  {"title": "Concordia Caribbean Student Union", "domain": "ieac.ca", "description": "Student group representing West indian community and it's diversity"},
  {"title": "Concordia Ceramics Student Association (CCSA)", "domain": "gmail.com", "description": "Student association for ceramics majors, or other fine arts students interested in ceramics"},
  {"title": "Concordia Cinema Politica Student Association", "domain": "cinemapolitica.org", "description": "Cinema Politica Concordia is a free political film series at Concordia University."},
  {"title": "Concordia Classics Student Organization", "domain": "asfa.ca", "description": "The Concordia Classics Student Association is a student-run organization which addresses the concerns of Classics students and promotes engagement."},
  {"title": "Concordia D2 Hockey Team", "domain": "gmail.com", "description": "Concordia Hockey team competing in the RSEQ university league"},
  {"title": "Concordia Debate Society", "domain": "csu.qc.ca", "description": "A recreational and competitive club dedicated to fostering community, and enhancing members debating and public speaking skills."},
  {"title": "Concordia Dragon Boat Club", "domain": "csu.qc.ca", "description": "We are an amateur sports team that aims to enrich Concordia students with Dragonboating and all activities that surround it."},
  {"title": "Concordia Electroacoustic Studies Student Association", "domain": "gmail.com", "description": "CESSA's primary mission, through its initiatives and its crucial role within the network of students and faculty, is to facilitate, promote, and advocate for the electroacoustic student body."},
  {"title": "Concordia Students Recreational Sports Club", "domain": "csu.qc.ca", "description": "This club aims to enrich student life by allowing members to try new sports, such as bowling, skating, bouldering, and volleyball."},
  {"title": "Concordia Students' Blood Donation Association", "domain": "gmail.com", "description": "CSBDA acts as a partnership between Concordia students and Héma-Québec, raising awareness of the importance of blood and other types of donations."},
  {"title": "Concordia Students' Nightline", "domain": "gmail.com", "description": "Anonymous, confidential, non-judgemental active listening line"},
  {"title": "Concordia Tennis Club", "domain": "csu.qc.ca", "description": "Students of all tennis levels are free to join to meet other players and share court time."},
  {"title": "Concordia Tennis Team", "domain": "gmail.com", "description": "The Club's mandate shall be to act as the main body for competitive tennis at Concordia University."},
  {"title": "Concordia Ukrainian Student Union (CUSU)", "domain": "ieac.ca", "description": "Concordia's Ukrainian"},
  {"title": "Concordia Undergraduate Journal of Art History (CUJAH)", "domain": "gmail.com", "description": "The Concordia Undergraduate Journal of Art History is a student-run association that publishes an annual journal and hosts an annual conference."},
  {"title": "Concordia Undergraduate Psychology Association", "domain": "asfa.ca", "description": "a student-led organization under the arts and science department catering to psychology and neuroscience students at Concordia University"},
  {"title": "Concordia University Building Engineering Society", "domain": "ecaconcordia.ca", "description": "Students association for building engineering students"},
  {"title": "Concordia University Tamil Mantram", "domain": "csu.qc.ca", "description": "Promotes Tamil culture and language and to play a role of gateway offering various information in order to foster a multi-cultural harmony."},
  {"title": "Concordia University Tea Enthusiasts Association", "domain": "csu.qc.ca", "description": "Concordia University's Tea Enthusiasts Association! We welcome everyone to join this exclusive club where you may have a one-of-a-kind tea experience."},
  {"title": "Creative Arts Therapies Student Graduate Association", "domain": "gmail.com", "description": "Student association that represents and serves graduate students in the Creative Arts Therapies Department."},
  {"title": "Pakistani Student Association", "domain": "csu.qc.ca", "description": "Celebrates the rich cultural heritage of Pakistan while fostering connections, promoting awareness and organizing events."},
  {"title": "Palestinian Cultural Club", "domain": "csu.qc.ca", "description": "Promotes and upholds Palestinian culture and heritage within our university."},
  {"title": "Pan African Student Union", "domain": "csu.qc.ca", "description": "A safe space for Black people, Africans and people from the African diaspora to further their studies on Pan Africanism"},
  {"title": "Performance Art Club", "domain": "gmail.com", "description": "PAC's mandate is to create a safe and inclusive platform for undergrad students interested in the practice of performance art."},
  {"title": "Power to Change", "domain": "csu.qc.ca", "description": "We are a group of people that believe Jesus changes everything."},
  {"title": "QPIRG Concordia", "domain": "qpirgconcordia.org", "description": "QPIRG Concordia is a resource for student, community research, and organizing that aims to connect the campus to grassroots community struggles."},
  {"title": "Quantitative Research and Competitions Club (QUARCC)", "domain": "csu.qc.ca", "description": "For students interested in developing quantitative skills and making a name for themselves through product building, competitions, or research."},
  {"title": "Queer Concordia", "domain": "gmail.com", "description": "LGBTQIA2S+ Non-Profit Organization for students on campus, providing events and resources"},
  {"title": "Queer Print Club", "domain": "gmail.com", "description": "QPC's mandate shall be to create a safer, non-hierarchical space for LGBTQIA2S+ students interested in print."},
  {"title": "Right to Move / La Voie Libre", "domain": "gmail.com", "description": "Community bike workshop"},
  {"title": "Running Club Montreal", "domain": "csu.qc.ca", "description": "Bringing the university community together through running by organizing training sessions and events for all levels."},
  {"title": "Science College Student Association", "domain": "asfa.ca", "description": "ASFA member association representing the students of the Science College"},
  {"title": "SCORE Association", "domain": "csu.qc.ca", "description": "A passion for creating music and with professional experience in the field of scoring to media."},
  {"title": "SEIZE Concordia", "domain": "solidarityeconomy.ca", "description": "SEIZE educates, organizes and incubates in support of the social solidarity economy"},
  {"title": "Self-Defence Club", "domain": "csu.qc.ca", "description": "Provides beginner-friendly weekly workshops/training sessions focused on practical self-defense techniques, confidence-building, and personal safety."},
  {"title": "Sex and Self", "domain": "csu.qc.ca", "description": "A student-run community organization that provides comprehensive pleasure-focused and gender-inclusive health and wellness resources."},
  {"title": "Shidokan Kendo & Iaido Club", "domain": "csu.qc.ca", "description": "Teaches, not only the physical aspect of Japanese fencing, but also the spiritual and mental aspects."},
  {"title": "Sociology and Anthropology Student Union (SASU)", "domain": "asfa.ca", "description": "Member association representing the undergraduate students of anthropology and sociology at Concordia University"},
  {"title": "Software engineering and Computer science Society (SCS)", "domain": "ecaconcordia.ca", "description": "Software engineering and computer science society"},
  {"title": "South Asian Student Association Concordia", "domain": "ieac.ca", "description": "The South Asian Student Association (SASA) is a student-led organization that celebrates and promotes South Asian culture, heritage, and community"},
  {"title": "Space Concordia", "domain": "spaceconcordia.ca", "description": "Space Concordia is a society developing a culture of technological and scientific excellence through participation in national and international competitions."}
]